Reports/СравнительныйАнализРаботыМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>СравнительныйАнализРаботыМенеджеров</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетЗамеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьПересечениеЗамеровВГрафике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортАдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветМеткиЗамераНаКартеЯндекс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаМетокЯндексКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполняемыхНормоЧасовМонтажаЗаЧасВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СравнительныйАнализРаботыМенеджеров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ДанныеВыбораПериодаИзВыпадающегоСписка;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыИзмененияФормы = Новый Структура;
	ПараметрыИзмененияФормы.Вставить("РеквизитыКУдалению", Новый Массив);
	ПараметрыИзмененияФормы.Вставить("СоответствиеКолонок", Новый Соответствие);
	
	Если НЕ ЗначениеЗаполнено(ОтборПериодЗначение) Тогда
		ОтборПериодЗначение.Вариант = ВариантСтандартногоПериода.Месяц;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГруппаПоказателей) Тогда
		ГруппаПоказателей = "Выручка";
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("СФормироватьПриОткрытии", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ГруппаПоказателейПриИзменении(Элемент)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодДатаНачалаПриИзменении(Элемент)
	
	Если ОтборПериодЗначение.ДатаНачала <> '00010101' Тогда
		ОтборПериодЗначение.ДатаНачала = НачалоДня(ОтборПериодЗначение.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодДатаОкончанияПриИзменении(Элемент)
	
	Если ОтборПериодЗначение.ДатаОкончания <> '00010101' Тогда
		ОтборПериодЗначение.ДатаОкончания = КонецДня(ОтборПериодЗначение.ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//Обработчик = Новый ОписаниеОповещения("ОтборМенеджерыЗавершениеВыбора", ЭтотОбъект);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("КлючУникальности",							ЭтаФорма.КлючНазначенияИспользования);
	//ПараметрыФормы.Вставить("Отмеченные",								ОтборМенеджеры);
	//ПараметрыФормы.Вставить("ЗначенияДляВыбора",						ОтборМенеджерыВсе);
	//ПараметрыФормы.Вставить("ВыводитьФлажок",							Истина);
	//ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями",	Ложь);
	//ПараметрыФормы.Вставить("ОписаниеТипов",							Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	//ПараметрыФормы.Вставить("Представление",							НСтр("ru = 'менеджеры'"));
	//
	//// Использование формы БСП 2.2.5
	//ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, , , , Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерыОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборМенеджерыВсе.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяДиаграммаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ГруппаПоказателей = "Выручка" Тогда
		
		ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выручка от продаж по менеджеру: %1, за период: с %2 по %3'"),
			?(ЗначениеЗаполнено(Расшифровка.Точка), Расшифровка.Точка, НСтр("ru = '<Менеджер не указан>'")),
			Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ менеджеров: продажи'"));
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуВыручки(Расшифровка.Точка));
		
		ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтаФорма, Истина);
		
	ИначеЕсли ГруппаПоказателей = "Заказы" Тогда
		
		СтрокаЛегенды = ЛегендаДиаграммы.НайтиСтроки(Новый Структура("Точка", Расшифровка.Точка))[0];
		ИмяКолонки = СтрЗаменить(Расшифровка.Серия, "Серия_", "Расшифровка_");
		ЗначениеРасшифровки = СтрокаЛегенды[ИмяКолонки];
		
		ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Заказы по менеджеру: %1, за период: с %2 по %3 %4'"),
			?(ЗначениеЗаполнено(Расшифровка.Точка), Расшифровка.Точка, НСтр("ru = '<Менеджер не указан>'")),
			Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy"),
			?(ЗначениеЗаполнено(Расшифровка.ЗаголовокСерии), "признак: " + Расшифровка.ЗаголовокСерии, ""));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ менеджеров: заказы'"));
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуЗаказов(ЗначениеРасшифровки, УникальныйИдентификатор));
		
		ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтаФорма, Истина);
		
	ИначеЕсли ГруппаПоказателей = "Задолженность" Тогда
		
		ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Задолженность клиентов менеджера: %1, по состоянию на %2'"),
			?(ЗначениеЗаполнено(Расшифровка.Точка), Расшифровка.Точка, НСтр("ru = '<Менеджер не указан>'")),
			Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ менеджеров: долги'"));
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуЗадолженности(Расшифровка.Точка));
		
		ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтаФорма, Истина);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛегендаДиаграммыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаЛегенды = ЛегендаДиаграммы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаЛегенды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ГруппаПоказателей = "Выручка" Тогда
		
		Точка = СтрокаЛегенды.Точка;
		
		ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выручка от продаж по менеджеру: %1, за период: с %2 по %3'"),
			?(ЗначениеЗаполнено(Точка), Точка, НСтр("ru = '<Менеджер не указан>'")),
			Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ менеджеров: продажи'"));
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуВыручки(Точка));
		
		ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтаФорма, Истина);
		
	ИначеЕсли ГруппаПоказателей = "Заказы" Тогда
		
		Точка = СтрокаЛегенды.Точка;
		
		Если Лев(Поле.Имя, 6) = "Серия_" Тогда
			Серия = Поле.Заголовок;
			ИмяСерии = Сред(Поле.Имя, 7);
			ЗначениеРасшифровки = СтрокаЛегенды["Расшифровка_" + ИмяСерии];
		Иначе
			ЗначениеРасшифровки = СтрокаЛегенды["Расшифровка_ЗаказыВсего"];
		КонецЕсли;
		
		ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Заказы по менеджеру: %1, за период: с %2 по %3 %4'"),
			?(ЗначениеЗаполнено(Точка), Точка, НСтр("ru = '<Менеджер не указан>'")),
			Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy"),
			?(ЗначениеЗаполнено(Серия), "признак: " + Серия, ""));
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ менеджеров: заказы'"));
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуЗаказов(ЗначениеРасшифровки, УникальныйИдентификатор));
		
		ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтаФорма, Истина);
		
	ИначеЕсли ГруппаПоказателей = "Задолженность" Тогда
		
		Точка = СтрокаЛегенды.Точка;
		
		ТекстОтборов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Задолженность клиентов менеджера: %1, по состоянию на %2'"),
			?(ЗначениеЗаполнено(Точка), Точка, НСтр("ru = '<Менеджер не указан>'")),
			Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy"));
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Анализ менеджеров: долги'"));
		ПараметрыФормы.Вставить("ПредставлениеОтборов", Новый ФорматированнаяСтрока(ТекстОтборов, Новый Шрифт(,,Истина)));
		ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуЗадолженности(Точка));
		
		ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтаФорма, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СФормироватьПриОткрытии()
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	ЦветаСерийДиаграммы = ОбщийМодульКлиентСервер.ЦветаСерийДиаграмм();
	
	Если ГруппаПоказателей = "Выручка" Тогда
		ОбновитьПоказателиВыручка();
	ИначеЕсли ГруппаПоказателей = "Заказы" Тогда
		ОбновитьПоказателиЗаказы();
	ИначеЕсли ГруппаПоказателей = "Задолженность" Тогда
		ОбновитьПоказателиЗадолженность();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиВыручка()
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	ДанныеПоПродажам = ДанныеПоПродажам(ОтборПериодЗначение);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеПоПродажам", 	ДанныеПоПродажам);
	Запрос.УстановитьПараметр("ОтборПоМенеджерам", 	ОтборМенеджеры.Количество() > 0);
	Запрос.УстановитьПараметр("ОтборМенеджеры", 	ОтборМенеджеры);
	Запрос.УстановитьПараметр("ОтборПоМетке", 	НЕ ОтборМетка.Пустая());//nva
	Запрос.УстановитьПараметр("ОтборМетка", 	ОтборМетка);//nva
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПоПродажам.ДокументПродажи КАК ДокументПродажи,
	|	ЕСТЬNULL(ДанныеПоПродажам.ДокументПродажиМенеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Менеджер,
	|	ДанныеПоПродажам.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ДанныеПоПродажам.СтоимостьПотолков + ДанныеПоПродажам.СтоимостьТоваров + ДанныеПоПродажам.СтоимостьУслуг КАК Выручка,
	|	ДанныеПоПродажам.СебестоимостьПотолков + ДанныеПоПродажам.СебестоимостьТоваров + ДанныеПоПродажам.СебестоимостьУслуг КАК Себестоимость,
	|	ДанныеПоПродажам.Прибыль КАК Прибыль,
	//nva+++
	|	ДанныеПоПродажам.КлиентМетка КАК КлиентМетка
	//nva---
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	&ДанныеПоПродажам КАК ДанныеПоПродажам
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоМенеджерам
	|				ТОГДА ЕСТЬNULL(ДанныеПоПродажам.ДокументПродажиМенеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) В (&ОтборМенеджеры)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ДанныеПоПродажам.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровИУслуг
	//nva+++
	|	И ВЫБОР
	|			КОГДА &ОтборПоМетке
	|				ТОГДА ЕСТЬNULL(ДанныеПоПродажам.КлиентМетка, ЗНАЧЕНИЕ(Справочник.МеткиКонтрагентов.ПустаяСсылка)) = &ОтборМетка
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//nva---
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Менеджер КАК Менеджер,
	|	ПродажиОбороты.ЗаказПокупателя КАК Заказ,
	|	ПродажиОбороты.Выручка КАК Выручка,
	|	ПродажиОбороты.Себестоимость КАК Себестоимость,
	|	ПродажиОбороты.Прибыль КАК ВаловаяПрибыль,
	|	ПродажиОбороты.Выручка КАК СредняяВыручка,
	|	ПРЕДСТАВЛЕНИЕ(ПродажиОбороты.Менеджер) КАК ПредставлениеМенеджера
	|ИЗ
	|	ВТ_Продажи КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПродажиОбороты.Менеджер,
	|	Выручка
	|ИТОГИ
	|	СУММА(Выручка),
	|	СУММА(Себестоимость),
	|	СУММА(ВаловаяПрибыль),
	|	СРЕДНЕЕ(СредняяВыручка)
	|ПО
	|	Менеджер,
	|	Заказ";
	
	ОсновнаяДиаграмма.Обновление = Ложь;
	ОсновнаяДиаграмма.Очистить();
	ОсновнаяДиаграмма.АвтоТранспонирование = Ложь;
	ОсновнаяДиаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	ОсновнаяДиаграмма.МаксимумСерий = МаксимумСерий.НеЗадано;
	ОсновнаяДиаграмма.ВидПодписей = ВидПодписейКДиаграмме.Нет;
	ОсновнаяДиаграмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ОсновнаяДиаграмма.ФорматЗначенийВПодписях = "ЧДЦ=2; ЧН=' '";
	ОсновнаяДиаграмма.АвтоУстановкаТекстаТочек = Ложь;
	ОсновнаяДиаграмма.ОбластьПостроения.ФорматШкалыЗначений = "ЧН=' '";
	ОсновнаяДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Истина;
	ОсновнаяДиаграмма.ОбластьПостроения.Шрифт = ШрифтыСтиля.МелкийШрифтТекста;
	
	Серия_Выручка = ОсновнаяДиаграмма.Серии.Добавить("Выручка");
	Серия_Выручка.Текст = "Выручка";
	
	Серия_Себестоимость = ОсновнаяДиаграмма.Серии.Добавить("Себестоимость");
	Серия_Себестоимость.Текст = "Себестоимость";
	
	Серия_ВаловаяПрибыль = ОсновнаяДиаграмма.Серии.Добавить("Валовая прибыль");
	Серия_ВаловаяПрибыль.Текст = "Валовая прибыль";
	
	Серия_СредняяВыручка = ОсновнаяДиаграмма.Серии.Добавить("Средняя выручка по заказу");
	Серия_СредняяВыручка.Текст = "Средняя выручка по заказу";
	
	ДанныеЛегендыДиаграммы = Новый ТаблицаЗначений;
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Точка", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ДанныеЛегендыДиаграммы.Колонки.Добавить("ПредставлениеТочки", Новый ОписаниеТипов("Строка"), "Менеджеры");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_Выручка", ОписаниеТипаЧисло, "Выручка");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_Себестоимость", ОписаниеТипаЧисло, "Себестоимость");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_ВаловаяПрибыль", ОписаниеТипаЧисло, "Валовая прибыль");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_СредняяВыручка", ОписаниеТипаЧисло, "Средняя выручка по заказу");
	
	ВыборкаМенеджер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМенеджер.Следующий() Цикл
		
		ПредставлениеМенеджера = ?(ЗначениеЗаполнено(ВыборкаМенеджер.Менеджер), ВыборкаМенеджер.ПредставлениеМенеджера, НСтр("ru = '<Менеджер не указан>'"));
		
		Точка = ОсновнаяДиаграмма.Точки.Добавить(ПредставлениеМенеджера);
		Точка.Текст = ПредставлениеМенеджера;
		
		СтрокаЛегенды = ДанныеЛегендыДиаграммы.Добавить();
		СтрокаЛегенды.Точка = ВыборкаМенеджер.Менеджер;
		СтрокаЛегенды.ПредставлениеТочки = ПредставлениеМенеджера;
		СтрокаЛегенды.Серия_Выручка = ВыборкаМенеджер.Выручка;
		СтрокаЛегенды.Серия_Себестоимость = ВыборкаМенеджер.Себестоимость;
		СтрокаЛегенды.Серия_ВаловаяПрибыль = ВыборкаМенеджер.ВаловаяПрибыль;
		СтрокаЛегенды.Серия_СредняяВыручка = ВыборкаМенеджер.СредняяВыручка;
		
		Расшифровка = Новый Структура("Точка", ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', выручка: '") + ВыборкаМенеджер.Выручка;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_Выручка, ВыборкаМенеджер.Выручка, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Точка", ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', себестоимость: '") + ВыборкаМенеджер.Себестоимость;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_Себестоимость, ВыборкаМенеджер.Себестоимость, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Точка", ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', валовая прибыль: '") + ВыборкаМенеджер.ВаловаяПрибыль;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_ВаловаяПрибыль, ВыборкаМенеджер.ВаловаяПрибыль, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Точка", ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', средняя выручка по заказу: '") + ВыборкаМенеджер.СредняяВыручка;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_СредняяВыручка, ВыборкаМенеджер.СредняяВыручка, Расшифровка, Подсказка);
		
	КонецЦикла;
	
	УстановитьЦветаСерийДиаграммы(ОсновнаяДиаграмма);
	ОсновнаяДиаграмма.Обновление = Истина;
	
	// Удаление элементов-колонок
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ЛегендаДиаграммы.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	// Добавление реквизитов-колонок
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		КолонкаРеквизит = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ЛегендаДиаграммы", Колонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(КолонкаРеквизит);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, ПараметрыИзмененияФормы.РеквизитыКУдалению);
	
	ПараметрыИзмененияФормы.РеквизитыКУдалению.Очистить();
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		ПараметрыИзмененияФормы.РеквизитыКУдалению.Добавить("ЛегендаДиаграммы." + Колонка.Имя);
	КонецЦикла;
	
	// Добавление элементов-колонок
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		
		Если Колонка.Заголовок = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементКолонка = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ЛегендаДиаграммы);
		ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКолонка.ПутьКДанным = "ЛегендаДиаграммы." + Колонка.Имя;
		ЭлементКолонка.Заголовок = Колонка.Заголовок;
		ЭлементКолонка.Формат = "ЧДЦ=2; ЧН=0";
		
		Если Колонка.Имя = "ПредставлениеТочки" Тогда
			
			ЭлементКолонка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
			
		ИначеЕсли Лев(Колонка.Имя, 6) = "Серия_" Тогда
			
			Если Колонка.Имя = "Серия_Выручка" Тогда
				ИндексСерии = 0;
				ЭлементКолонка.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветФонаФормы;
			ИначеЕсли Колонка.Имя = "Серия_Себестоимость" Тогда
				ИндексСерии = 1;
			ИначеЕсли Колонка.Имя = "Серия_ВаловаяПрибыль" Тогда
				ИндексСерии = 2;
			ИначеЕсли Колонка.Имя = "Серия_СредняяВыручка" Тогда
				ИндексСерии = 3;
			КонецЕсли;
			
			Серия = ОсновнаяДиаграмма.Серии.Получить(ИндексСерии);
			ЭлементКолонка.ЦветФонаЗаголовка = Серия.Цвет;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение данных
	ЛегендаДиаграммы.Очистить();
	Для Каждого СтрокаЛегенды Из ДанныеЛегендыДиаграммы Цикл
		НоваяСтрока = ЛегендаДиаграммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЛегенды);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиЗаказы()
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	ОписаниеТипаСписок = Новый ОписаниеТипов("СписокЗначений");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказателиЗаказы();
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		
		ОтборЗапроса.Добавить("ЗаказПокупателя.Менеджер В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончание", ОтборПериодЗначение.ДатаОкончания);
	
	ОсновнаяДиаграмма.Обновление = Ложь;
	ОсновнаяДиаграмма.Очистить();
	ОсновнаяДиаграмма.АвтоТранспонирование = Ложь;
	ОсновнаяДиаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	ОсновнаяДиаграмма.МаксимумСерий = МаксимумСерий.НеЗадано;
	ОсновнаяДиаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	ОсновнаяДиаграмма.ПоложениеПодписей = ПоложениеПодписейКДиаграмме.Центр;
	ОсновнаяДиаграмма.ШрифтПодписей = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	ОсновнаяДиаграмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ОсновнаяДиаграмма.ФорматЗначенийВПодписях = "ЧДЦ=; ЧН=' '";
	ОсновнаяДиаграмма.АвтоУстановкаТекстаТочек = Ложь;
	ОсновнаяДиаграмма.ОбластьПостроения.ФорматШкалыЗначений = "ЧН=' '";
	ОсновнаяДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Истина;
	ОсновнаяДиаграмма.ОбластьПостроения.Шрифт = ШрифтыСтиля.МелкийШрифтТекста;
	
	ЦветаСерий = ЦветаСерийДиаграмм();
	
	Серия_ЗаказыВсего = ОсновнаяДиаграмма.Серии.Добавить("Заказы всего");
	Серия_ЗаказыВсего.Текст = "Заказы всего";
	Серия_ЗаказыВсего.Цвет = ЦветаСерий[3];
	
	Серия_Первичные = ОсновнаяДиаграмма.Серии.Добавить("Первичные");
	Серия_Первичные.Текст = "Заказы новых клиентов";
	Серия_Первичные.Цвет = ЦветаСерий[1];
	
	Серия_Оплаченные = ОсновнаяДиаграмма.Серии.Добавить("Оплаченные");
	Серия_Оплаченные.Текст = "Оплаченные";
	Серия_Оплаченные.Цвет = ЦветаСерий[4];
	
	Серия_ЧастичноОплаченные = ОсновнаяДиаграмма.Серии.Добавить("Частично оплаченные");
	Серия_ЧастичноОплаченные.Текст = "Частично оплаченные";
	Серия_ЧастичноОплаченные.Цвет = ЦветаСерий[2];
	
	Серия_Неоплаченные = ОсновнаяДиаграмма.Серии.Добавить("Неоплаченные");
	Серия_Неоплаченные.Текст = "Неоплаченные";
	Серия_Неоплаченные.Цвет = ЦветаСерий[0];
	
	ДанныеЛегендыДиаграммы = Новый ТаблицаЗначений;
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Точка", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ДанныеЛегендыДиаграммы.Колонки.Добавить("ПредставлениеТочки", Новый ОписаниеТипов("Строка"), "Менеджеры");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_ЗаказыВсего", ОписаниеТипаЧисло, "Заказы всего");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_Первичные", ОписаниеТипаЧисло, "Заказы новых клиентов");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_Оплаченные", ОписаниеТипаЧисло, "Оплаченные");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_ЧастичноОплаченные", ОписаниеТипаЧисло, "Частично оплаченные");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_Неоплаченные", ОписаниеТипаЧисло, "Неоплаченные");
	
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Расшифровка_ЗаказыВсего", ОписаниеТипаСписок);
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Расшифровка_Первичные", ОписаниеТипаСписок);
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Расшифровка_Оплаченные", ОписаниеТипаСписок);
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Расшифровка_ЧастичноОплаченные", ОписаниеТипаСписок);
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Расшифровка_Неоплаченные", ОписаниеТипаСписок);
	
	ВыборкаМенеджер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМенеджер.Следующий() Цикл
		
		ПредставлениеМенеджера = ?(ЗначениеЗаполнено(ВыборкаМенеджер.Менеджер), ВыборкаМенеджер.ПредставлениеМенеджера, НСтр("ru = '<Менеджер не указан>'"));
		
		Точка = ОсновнаяДиаграмма.Точки.Добавить(ПредставлениеМенеджера);
		Точка.Текст = ПредставлениеМенеджера;
		
		СтрокаЛегенды = ДанныеЛегендыДиаграммы.Добавить();
		СтрокаЛегенды.Точка = ВыборкаМенеджер.Менеджер;
		СтрокаЛегенды.ПредставлениеТочки = ПредставлениеМенеджера;
		СтрокаЛегенды.Серия_ЗаказыВсего = ВыборкаМенеджер.ЗаказыВсего;
		СтрокаЛегенды.Серия_Первичные = ВыборкаМенеджер.Первичные;
		СтрокаЛегенды.Серия_Оплаченные = ВыборкаМенеджер.Оплаченные;
		СтрокаЛегенды.Серия_ЧастичноОплаченные = ВыборкаМенеджер.ЧастичноОплаченные;
		СтрокаЛегенды.Серия_Неоплаченные = ВыборкаМенеджер.Неоплаченные;
		
		Расшифровка = Новый Структура("Серия, ЗаголовокСерии, Точка", "Серия_ЗаказыВсего", ДанныеЛегендыДиаграммы.Колонки.Серия_ЗаказыВсего.Заголовок, ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', заказов всего: '") + ВыборкаМенеджер.ЗаказыВсего;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_ЗаказыВсего, ВыборкаМенеджер.ЗаказыВсего, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Серия, ЗаголовокСерии, Точка", "Серия_Первичные", ДанныеЛегендыДиаграммы.Колонки.Серия_Первичные.Заголовок, ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', заказов новых клиентов: '") + ВыборкаМенеджер.Первичные;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_Первичные, ВыборкаМенеджер.Первичные, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Серия, ЗаголовокСерии, Точка", "Серия_Оплаченные", ДанныеЛегендыДиаграммы.Колонки.Серия_Оплаченные.Заголовок, ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', оплаченных заказов: '") + ВыборкаМенеджер.Оплаченные;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_Оплаченные, ВыборкаМенеджер.Оплаченные, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Серия, ЗаголовокСерии, Точка", "Серия_ЧастичноОплаченные", ДанныеЛегендыДиаграммы.Колонки.Серия_ЧастичноОплаченные.Заголовок, ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', частично оплаченных заказов: '") + ВыборкаМенеджер.ЧастичноОплаченные;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_ЧастичноОплаченные, ВыборкаМенеджер.ЧастичноОплаченные, Расшифровка, Подсказка);
		
		Расшифровка = Новый Структура("Серия, ЗаголовокСерии, Точка", "Серия_Неоплаченные", ДанныеЛегендыДиаграммы.Колонки.Серия_Неоплаченные.Заголовок, ВыборкаМенеджер.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', неоплаченных заказов: '") + ВыборкаМенеджер.Неоплаченные;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_Неоплаченные, ВыборкаМенеджер.Неоплаченные, Расшифровка, Подсказка);
		
		Выборка = ВыборкаМенеджер.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.ЗаказыВсего = Null Тогда
				СтрокаЛегенды.Расшифровка_ЗаказыВсего.Добавить(Выборка.ЗаказыВсего);
			КонецЕсли;
			Если НЕ Выборка.Первичные = Null Тогда
				СтрокаЛегенды.Расшифровка_Первичные.Добавить(Выборка.Первичные);
			КонецЕсли;
			Если НЕ Выборка.Оплаченные = Null Тогда
				СтрокаЛегенды.Расшифровка_Оплаченные.Добавить(Выборка.Оплаченные);
			КонецЕсли;
			Если НЕ Выборка.ЧастичноОплаченные = Null Тогда
				СтрокаЛегенды.Расшифровка_ЧастичноОплаченные.Добавить(Выборка.ЧастичноОплаченные);
			КонецЕсли;
			Если НЕ Выборка.Неоплаченные = Null Тогда
				СтрокаЛегенды.Расшифровка_Неоплаченные.Добавить(Выборка.Неоплаченные);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ОсновнаяДиаграмма.Обновление = Истина;
	
	// Удаление элементов-колонок
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ЛегендаДиаграммы.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	// Добавление реквизитов-колонок
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		КолонкаРеквизит = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ЛегендаДиаграммы", Колонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(КолонкаРеквизит);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, ПараметрыИзмененияФормы.РеквизитыКУдалению);
	
	ПараметрыИзмененияФормы.РеквизитыКУдалению.Очистить();
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		ПараметрыИзмененияФормы.РеквизитыКУдалению.Добавить("ЛегендаДиаграммы." + Колонка.Имя);
	КонецЦикла;
	
	// Добавление элементов-колонок
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		
		Если Колонка.Заголовок = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементКолонка = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ЛегендаДиаграммы);
		ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКолонка.ПутьКДанным = "ЛегендаДиаграммы." + Колонка.Имя;
		ЭлементКолонка.Заголовок = Колонка.Заголовок;
		ЭлементКолонка.Формат = "ЧДЦ=; ЧН=0";
		
		Если Колонка.Имя = "ПредставлениеТочки" Тогда
			
			ЭлементКолонка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
			
		ИначеЕсли Лев(Колонка.Имя, 6) = "Серия_" Тогда
			
			Если Колонка.Имя = "Серия_ЗаказыВсего" Тогда
				ИндексСерии = 0;
				ЭлементКолонка.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветФонаФормы;
			ИначеЕсли Колонка.Имя = "Серия_Первичные" Тогда
				ИндексСерии = 1;
			ИначеЕсли Колонка.Имя = "Серия_Оплаченные" Тогда
				ИндексСерии = 2;
			ИначеЕсли Колонка.Имя = "Серия_ЧастичноОплаченные" Тогда
				ИндексСерии = 3;
			ИначеЕсли Колонка.Имя = "Серия_Неоплаченные" Тогда
				ИндексСерии = 4;
			КонецЕсли;
			
			Серия = ОсновнаяДиаграмма.Серии.Получить(ИндексСерии);
			ЭлементКолонка.ЦветФонаЗаголовка = Серия.Цвет;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение данных
	ЛегендаДиаграммы.Очистить();
	Для Каждого СтрокаЛегенды Из ДанныеЛегендыДиаграммы Цикл
		НоваяСтрока = ЛегендаДиаграммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЛегенды);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиЗадолженность()
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказателиЗадолженность();		
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		
		//СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса(
		//	 Строка(СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[1].Выражение) + "
		//	 |	И Контрагент.Менеджер В (&ОтборМенеджеры)");
		
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;		
		ОтборЗапроса.Добавить("Контрагент.Менеджер В (&ОтборМенеджеры)");
		
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодОкончание", ОтборПериодЗначение.ДатаОкончания);
	
	ОсновнаяДиаграмма.Обновление = Ложь;
	ОсновнаяДиаграмма.Очистить();
	ОсновнаяДиаграмма.АвтоТранспонирование = Ложь;
	ОсновнаяДиаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	ОсновнаяДиаграмма.МаксимумСерий = МаксимумСерий.НеЗадано;
	ОсновнаяДиаграмма.ВидПодписей = ВидПодписейКДиаграмме.Нет;
	ОсновнаяДиаграмма.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ОсновнаяДиаграмма.АвтоУстановкаТекстаТочек = Ложь;
	ОсновнаяДиаграмма.ОбластьПостроения.ФорматШкалыЗначений = "ЧН=' '";
	ОсновнаяДиаграмма.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Истина;
	ОсновнаяДиаграмма.ОбластьПостроения.Шрифт = ШрифтыСтиля.МелкийШрифтТекста;
	
	Серия_Задолженность = ОсновнаяДиаграмма.Серии.Добавить("Задолженность");
	Серия_Задолженность.Текст = "Задолженность";
	
	//Серия_ПросроченнаяЗадолженность = ОсновнаяДиаграмма.Серии.Добавить("Просроченная задолженность");
	//Серия_ПросроченнаяЗадолженность.Текст = "Просроченная задолженность";
	
	ДанныеЛегендыДиаграммы = Новый ТаблицаЗначений;
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Точка", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ДанныеЛегендыДиаграммы.Колонки.Добавить("ПредставлениеТочки", Новый ОписаниеТипов("Строка"), "Менеджеры");
	ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_Задолженность", ОписаниеТипаЧисло, "Задолженность");
	//ДанныеЛегендыДиаграммы.Колонки.Добавить("Серия_ПросроченнаяЗадолженность", ОписаниеТипаЧисло, "Просроченная задолженность");
	
	ДанныеЛегендыДиаграммы.Колонки.Добавить("КоличествоДолжников", ОписаниеТипаЧисло);
	ДанныеЛегендыДиаграммы.Колонки.Добавить("ПредставлениеДолжников", Новый ОписаниеТипов("Строка"), "Должники");
	
	ВсегоДолжников = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПредставлениеМенеджера = ?(ЗначениеЗаполнено(Выборка.Менеджер), Выборка.ПредставлениеМенеджера, НСтр("ru = '<Менеджер не указан>'"));
		
		Точка = ОсновнаяДиаграмма.Точки.Добавить(ПредставлениеМенеджера);
		Точка.Текст = ПредставлениеМенеджера;
		
		СтрокаЛегенды = ДанныеЛегендыДиаграммы.Добавить();
		СтрокаЛегенды.Точка = Выборка.Менеджер;
		СтрокаЛегенды.ПредставлениеТочки = ПредставлениеМенеджера;
		СтрокаЛегенды.Серия_Задолженность = Выборка.Задолженность;
		//СтрокаЛегенды.Серия_ПросроченнаяЗадолженность = Выборка.ПросроченнаяЗадолженность;
		СтрокаЛегенды.КоличествоДолжников = Выборка.Должники;
		
		Расшифровка = Новый Структура("Точка", Выборка.Менеджер);
		Подсказка = ПредставлениеМенеджера + НСтр("ru = ', задолженность: '") + Выборка.Задолженность;
		ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_Задолженность, Выборка.Задолженность, Расшифровка, Подсказка);
		
		//Расшифровка = Новый Структура("Точка", Выборка.Менеджер);
		//Подсказка = ПредставлениеМенеджера + НСтр("ru = ', просроченная задолженность: '") + Выборка.ПросроченнаяЗадолженность;
		//ОсновнаяДиаграмма.УстановитьЗначение(Точка, Серия_ПросроченнаяЗадолженность, Выборка.ПросроченнаяЗадолженность, Расшифровка, Подсказка);
		
		ВсегоДолжников = ВсегоДолжников + Выборка.Должники;
		
	КонецЦикла;
	
	// Построим вывод количества должников
	Для Каждого СтрокаЛегенды Из ДанныеЛегендыДиаграммы Цикл
		СтрокаЛегенды.ПредставлениеДолжников = ПолучитьПредставлениеДолжников(СтрокаЛегенды.КоличествоДолжников, ВсегоДолжников);
	КонецЦикла;
	
	УстановитьЦветаСерийДиаграммы(ОсновнаяДиаграмма);
	ОсновнаяДиаграмма.Обновление = Истина;
	
	// Удаление элементов-колонок
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого Элемент Из Элементы.ЛегендаДиаграммы.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	// Добавление реквизитов-колонок
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		КолонкаРеквизит = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ЛегендаДиаграммы", Колонка.Заголовок);
		ДобавляемыеРеквизиты.Добавить(КолонкаРеквизит);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, ПараметрыИзмененияФормы.РеквизитыКУдалению);
	
	ПараметрыИзмененияФормы.РеквизитыКУдалению.Очистить();
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		ПараметрыИзмененияФормы.РеквизитыКУдалению.Добавить("ЛегендаДиаграммы." + Колонка.Имя);
	КонецЦикла;
	
	// Добавление элементов-колонок
	Для Каждого Колонка Из ДанныеЛегендыДиаграммы.Колонки Цикл
		
		Если Колонка.Заголовок = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементКолонка = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ЛегендаДиаграммы);
		ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКолонка.ПутьКДанным = "ЛегендаДиаграммы." + Колонка.Имя;
		ЭлементКолонка.Заголовок = Колонка.Заголовок;
		
		Если Колонка.Имя = "ПредставлениеТочки" Тогда
			
			ЭлементКолонка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
			
		ИначеЕсли Лев(Колонка.Имя, 6) = "Серия_" Тогда
			
			Если Колонка.Имя = "Серия_Задолженность" Тогда
				ИндексСерии = 0;
			//ИначеЕсли Колонка.Имя = "Серия_ПросроченнаяЗадолженность" Тогда
			//	ИндексСерии = 1;
			КонецЕсли;
			
			Серия = ОсновнаяДиаграмма.Серии.Получить(ИндексСерии);
			ЭлементКолонка.ЦветФонаЗаголовка = Серия.Цвет;
			ЭлементКолонка.Формат = "ЧДЦ=2; ЧН=0";
			
		ИначеЕсли Колонка.Имя = "ПредставлениеДолжников" Тогда
			
			ЭлементКолонка.ЦветТекста = WebЦвета.СинеСерый; //ЦветаСтиля.ЦветТекстаСвязаннойИнформации;
			ЭлементКолонка.Шрифт = Новый Шрифт(,,Истина);
			ЭлементКолонка.Формат = "ЧДЦ=0; ЧН=0";
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение данных
	ЛегендаДиаграммы.Очистить();
	Для Каждого СтрокаЛегенды Из ДанныеЛегендыДиаграммы Цикл
		НоваяСтрока = ЛегендаДиаграммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЛегенды);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьРасшифровкуВыручки(Менеджер)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Продажи";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Продажи";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.СравнительныйАнализРаботыМенеджеров.ПФ_MXL_ВыручкаРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	ДанныеПоПродажам = ДанныеПоПродажам(ОтборПериодЗначение);
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеПоПродажам", 	ДанныеПоПродажам);
	Запрос.УстановитьПараметр("Менеджер", 			Менеджер);	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПоПродажам.ДокументПродажи КАК ДокументПродажи,
	|	ЕСТЬNULL(ДанныеПоПродажам.ДокументПродажиМенеджер, Значение(Справочник.Сотрудники.ПустаяСсылка)) КАК Менеджер,
	|	ДанныеПоПродажам.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ДанныеПоПродажам.Регистратор КАК Регистратор,
	|	ДанныеПоПродажам.РегистраторДата КАК Период,
	|	ДанныеПоПродажам.СтоимостьПотолков + ДанныеПоПродажам.СтоимостьТоваров + ДанныеПоПродажам.СтоимостьУслуг КАК Выручка,
	|	ДанныеПоПродажам.СебестоимостьПотолков + ДанныеПоПродажам.СебестоимостьТоваров + ДанныеПоПродажам.СебестоимостьУслуг КАК Себестоимость,
	|	ЕСТЬNULL(ДанныеПоПродажам.Прибыль, 0) КАК Прибыль
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	&ДанныеПоПродажам КАК ДанныеПоПродажам
	|ГДЕ
	|	ЕСТЬNULL(ДанныеПоПродажам.ДокументПродажиМенеджер, Значение(Справочник.Сотрудники.ПустаяСсылка)) = &Менеджер
	|	И ДанныеПоПродажам.ДокументПродажи ССЫЛКА Документ.РеализацияТоваровИУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Период КАК Период,
	|	ПродажиОбороты.Регистратор КАК Регистратор,
	|	ПродажиОбороты.ЗаказПокупателя КАК Заказ,
	|	ПродажиОбороты.Выручка КАК Выручка,
	|	ПродажиОбороты.Себестоимость КАК Себестоимость,
	|	ПродажиОбороты.Прибыль КАК ВаловаяПрибыль,
	|	ПРЕДСТАВЛЕНИЕ(ПродажиОбороты.Регистратор) КАК ПредставлениеРегистратора,
	|	ПРЕДСТАВЛЕНИЕ(ПродажиОбороты.ЗаказПокупателя) КАК ПредставлениеЗаказа
	|ИЗ
	|	ВТ_Продажи КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
		
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	ВыручкаИтог = 0;
	СебестоимостьИтог = 0;
	ВаловаяПрибыльИтог = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		ВыручкаИтог = ВыручкаИтог + Выборка.Выручка;
		СебестоимостьИтог = СебестоимостьИтог + Выборка.Себестоимость;
		ВаловаяПрибыльИтог = ВаловаяПрибыльИтог + Выборка.ВаловаяПрибыль;
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.ВыручкаИтог = ВыручкаИтог;
	СтруктураОбластей.Итог.Параметры.СебестоимостьИтог = СебестоимостьИтог;
	СтруктураОбластей.Итог.Параметры.ВаловаяПрибыльИтог = ВаловаяПрибыльИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуЗаказов(Заказы, УникальныйИдентификатор)
	
	//Возврат ПоместитьВоВременноеХранилище(Документы.ЗаказПокупателя.ПечатнаяФормаКарточкиЗаказов(Заказы, Истина, Истина), УникальныйИдентификатор);
	
	РаскрашиватьОплату    = Истина;
	//РаскрашиватьСтатусы   = Истина;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_КарточкиЗаказов";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КарточкиЗаказов";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если РаскрашиватьОплату Тогда
		Цвета = ЦветаСерийДиаграмм();
		ЦветБезОплаты = Цвета[0];
		ЦветЧастичнаяОплата = Цвета[2];
		ЦветПолнаяОплата = Цвета[4];
	КонецЕсли;
	
	СтруктураОбластей = Новый Структура;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.СравнительныйАнализРаботыМенеджеров.ПФ_MXL_ЗаказыРасшифровка");
	
	СтруктураОбластей.Вставить("Заголовок",				Макет.ПолучитьОбласть("Заголовок"));
	СтруктураОбластей.Вставить("Шапка",					Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Комментарий",			Макет.ПолучитьОбласть("Комментарий"));
	СтруктураОбластей.Вставить("Отступ",				Макет.ПолучитьОбласть("Отступ"));
	СтруктураОбластей.Вставить("ОтступСПодчеркиванием",	Макет.ПолучитьОбласть("ОтступСПодчеркиванием"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказателиЗаказы(Истина);	
	Запрос.УстановитьПараметр("Заказы", Заказы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
		
		СтруктураОбластей.Заголовок.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Заголовок);
		
		СтруктураОбластей.Шапка.Параметры.Заполнить(Выборка);
		СтруктураОбластей.Шапка.Параметры.СуммаОплаты = Формат(Выборка.СуммаОплаты, "ЧДЦ=2; ЧН=0,00");
		СтруктураОбластей.Шапка.Параметры.ПроцентОплаты = Формат(Выборка.ПроцентОплаты, "ЧДЦ=; ЧН=0");
		
		//Если РаскрашиватьСостояния Тогда
		//	ОбластьСостояние = СтруктураОбластей.Шапка.Область("ОбластьСостояние");
		//	ЦветСостояния = Выборка.ЦветСостояния.Получить();
		//	Если ЦветСостояния = Неопределено Тогда
		//		ОбластьСостояние.ЦветТекста = Новый Цвет;
		//	Иначе
		//		ОбластьСостояние.ЦветТекста = ЦветСостояния;
		//	КонецЕсли;
		//КонецЕсли;
		
		ОбластьОплата = СтруктураОбластей.Шапка.Область("ОбластьОплата");
		Если РаскрашиватьОплату Тогда
			Если Выборка.ПроцентОплаты = 100 Тогда
				ОбластьОплата.ЦветТекста = ЦветПолнаяОплата;
			ИначеЕсли Выборка.ПроцентОплаты > 0 И Выборка.ПроцентОплаты < 100 Тогда
				ОбластьОплата.ЦветТекста = ЦветЧастичнаяОплата;
			ИначеЕсли Выборка.ПроцентОплаты = 0 Тогда
				ОбластьОплата.ЦветТекста = ЦветБезОплаты;
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
		
		Если НЕ ПустаяСтрока(Выборка.Комментарий) Тогда
			ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
			СтруктураОбластей.Комментарий.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(СтруктураОбластей.Комментарий);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(СтруктураОбластей.ОтступСПодчеркиванием);
		
	КонецЦикла;	
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуЗадолженности(Менеджер)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Продажи";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Продажи";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.СравнительныйАнализРаботыМенеджеров.ПФ_MXL_ЗадолженностьРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказателиЗадолженность(Истина);	
	Запрос.УстановитьПараметр("ПериодОкончание", ОтборПериодЗначение.ДатаОкончания);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	ЗадолженностьИтог = 0;
	ПросроченнаяЗадолженностьИтог = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		ЗадолженностьИтог = ЗадолженностьИтог + Выборка.Задолженность;
		ПросроченнаяЗадолженностьИтог = ПросроченнаяЗадолженностьИтог + Выборка.ПросроченнаяЗадолженность;
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.ЗадолженностьИтог = ЗадолженностьИтог;
	//СтруктураОбластей.Итог.Параметры.ПросроченнаяЗадолженностьИтог = ПросроченнаяЗадолженностьИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПоПродажам(Период)

	УстановитьПривилегированныйРежим(Истина); // №14884 у пользователям может не быть доступа к отчёту валовая прибыль
	СхемаКомпоновкиДанных = Отчеты.ВаловаяПрибыльПроизводство.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	УстановитьПривилегированныйРежим(Ложь);
	
	// Подготовка компоновщика макета компоновки данных, загрузка настроек
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));

	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	ГруппировкаДетальныеЗаписи = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныеЗаписи.Использование = Истина;
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "ДокументПродажи");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "ДокументПродажи.Менеджер");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "ЗаказПокупателя");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Регистратор");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Регистратор.Дата");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Клиент.Метка");//nva
	
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "СтоимостьПотолков");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "СтоимостьТоваров");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "СтоимостьУслуг");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "СебестоимостьПотолков");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "СебестоимостьТоваров");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "СебестоимостьУслуг");
	ДобавитьВыбранноеПолеСКД(ГруппировкаДетальныеЗаписи, "Прибыль");
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если Параметр <> Неопределено Тогда
		Параметр.Использование = Истина;
		Параметр.Значение = Период.ДатаНачала;
	КонецЕсли;

	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если Параметр <> Неопределено Тогда
		Параметр.Использование = Истина;
		Параметр.Значение = Период.ДатаОкончания;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

	ДанныеОтчета = Новый ТаблицаЗначений();
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ДанныеОтчета = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Возврат ДанныеОтчета;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьВыбранноеПолеСКД(ГруппировкаКомпоновкиДанных, Поле) Экспорт
	
	ВыбранноеПоле               = ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле          = Новый ПолеКомпоновкиДанных(Поле);
	ВыбранноеПоле.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПоказателиЗаказы(Расшифровка = Ложь)
	
	Если НЕ Расшифровка Тогда
		Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК Заказ
		|ПОМЕСТИТЬ втПервичныеЗаказы
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателяПредыдущие
		|		ПО ЗаказПокупателя.Контрагент = ЗаказПокупателяПредыдущие.Контрагент
		|			И ЗаказПокупателя.МоментВремени > ЗаказПокупателяПредыдущие.МоментВремени
		|ГДЕ
		|	ЗаказПокупателя.Проведен = ИСТИНА
		|	И ЗаказПокупателя.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ЗаказПокупателяПредыдущие.Ссылка) = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Менеджер КАК Менеджер,
		|	ЗаказПокупателя.Ссылка КАК ЗаказыВсего,
		|	втПервичныеЗаказы.Заказ КАК Первичные,
		|	ВЫБОР
		|		КОГДА РасчетыПоЗаказамОбороты.СуммаПриход <= РасчетыПоЗаказамОбороты.СуммаРасход
		|			ТОГДА ЗаказПокупателя.Ссылка
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Оплаченные,
		|	ВЫБОР
		|		КОГДА РасчетыПоЗаказамОбороты.СуммаРасход > 0
		|				И РасчетыПоЗаказамОбороты.СуммаРасход < РасчетыПоЗаказамОбороты.СуммаПриход
		|			ТОГДА ЗаказПокупателя.Ссылка
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ЧастичноОплаченные,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РасчетыПоЗаказамОбороты.СуммаПриход, 0) > 0
		|				И ЕСТЬNULL(РасчетыПоЗаказамОбороты.СуммаРасход, 0) = 0
		|			ТОГДА ЗаказПокупателя.Ссылка
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Неоплаченные,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.Менеджер) КАК ПредставлениеМенеджера
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Обороты КАК РасчетыПоЗаказамОбороты
		|		ПО (ЗаказПокупателя.Ссылка = (ВЫРАЗИТЬ(РасчетыПоЗаказамОбороты.Заказ КАК Документ.ЗаказПокупателя)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПервичныеЗаказы КАК втПервичныеЗаказы
		|		ПО ЗаказПокупателя.Ссылка = втПервичныеЗаказы.Заказ
		|ГДЕ
		|	ЗаказПокупателя.Проведен = ИСТИНА
		|	И ЗаказПокупателя.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И НЕ ЗаказПокупателя.ВнутреннийЗаказ И НЕ ЗаказПокупателя.ЭтоЗаказОтРозницы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокупателя.Менеджер.Наименование
		|ИТОГИ
		|	КОЛИЧЕСТВО(ЗаказыВсего),
		|	КОЛИЧЕСТВО(Первичные),
		|	КОЛИЧЕСТВО(Оплаченные),
		|	КОЛИЧЕСТВО(ЧастичноОплаченные),
		|	КОЛИЧЕСТВО(Неоплаченные)
		|ПО
		|	Менеджер";
		
	Иначе
		Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК Заказ
		|ПОМЕСТИТЬ втПервыйЗаказ
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателяПредыдущие
		|		ПО ЗаказПокупателя.Контрагент = ЗаказПокупателяПредыдущие.Контрагент
		|			И ЗаказПокупателя.МоментВремени > ЗаказПокупателяПредыдущие.МоментВремени
		|ГДЕ
		|	ЗаказПокупателя.Ссылка В(&Заказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ЗаказПокупателяПредыдущие.Ссылка) = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Заказ,
		|	ЗаказПокупателя.ТекущийСтатус КАК ТекущийСтатус,
		|	ЗаказПокупателя.СуммаДокумента КАК СуммаЗаказа,		
		|	ЕСТЬNULL(РасчетыПоЗаказамОбороты.СуммаРасход, 0) КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.СуммаДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ (ЕСТЬNULL(РасчетыПоЗаказамОбороты.СуммаРасход, 0)) * 100 / ЗаказПокупателя.СуммаДокумента
		|	КОНЕЦ КАК ПроцентОплаты,
		|	ЗаказПокупателя.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА втПервыйЗаказ.Заказ ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПервыйЗаказ,
		|	ЗаказПокупателя.Менеджер КАК Менеджер,
		|	ЗаказПокупателя.Комментарий КАК Комментарий,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.Ссылка) КАК ЗаказПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.ТекущийСтатус) КАК ТекущийСтатусПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.Менеджер) КАК МенеджерПредставление
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Обороты КАК РасчетыПоЗаказамОбороты
		|		ПО (ЗаказПокупателя.Ссылка = (ВЫРАЗИТЬ(РасчетыПоЗаказамОбороты.Заказ КАК Документ.ЗаказПокупателя)))
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПервыйЗаказ КАК втПервыйЗаказ
		|		ПО ЗаказПокупателя.Ссылка = втПервыйЗаказ.Заказ
		|ГДЕ
		|	ЗаказПокупателя.Ссылка В(&Заказы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокупателя.Дата";
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПоказателиЗадолженность(Расшифровка = Ложь)
	
	Если НЕ Расшифровка Тогда
		Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетыСПокупателямиОстатки.Контрагент) КАК Должники,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.Контрагент.Менеджер, Значение(Справочник.Сотрудники.ПустаяСсылка)) КАК Менеджер,
		|	ПРЕДСТАВЛЕНИЕ(РасчетыСПокупателямиОстатки.Контрагент.Менеджер) КАК ПредставлениеМенеджера,
		|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) КАК Задолженность,
		|	0 КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ПериодОкончание, ) КАК РасчетыСПокупателямиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПокупателямиОстатки.Контрагент.Менеджер
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетыСПокупателямиОстатки.СуммаОстаток) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасчетыСПокупателямиОстатки.Контрагент.Менеджер.Наименование";
		
	Иначе
		Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(РасчетыСПокупателямиОстатки.Контрагент) КАК ПредставлениеКонтрагента,
		|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Задолженность,
		|	0 КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			&ПериодОкончание,
		|			Контрагент.Менеджер = &Менеджер) КАК РасчетыСПокупателямиОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасчетыСПокупателямиОстатки.Контрагент.Наименование";
		
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеДолжников(КоличествоДолжников, МаксКоличество)
	
	СимволовВДиаграмме = 12;
	
	ДлинаСтроки = Окр(КоличествоДолжников * СимволовВДиаграмме / МаксКоличество);
	
	Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("█", ДлинаСтроки) + "  " + КоличествоДолжников;
	
КонецФункции

&НаКлиенте
Процедура ОтборМенеджерыЗавершениеВыбора(РезультатВыбора, ПараметрыОбработчика) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ОтборМенеджерыВсе = РезультатВыбора;
	
	ОтборМенеджеры = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из РезультатВыбора Цикл
		Если ЭлементСписка.Пометка Тогда
			ОтборМенеджеры.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка, ЭлементСписка.Картинка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЦветаСерийДиаграммы(Диаграмма)
	
	ЦветаСерий = ЦветаСерийДиаграмм();
	
	Для ИндексСерии = 0 По Диаграмма.Серии.Количество() - 1 Цикл
		
		Серия = Диаграмма.Серии[ИндексСерии];
		Серия.Цвет = ЦветаСерий[ИндексСерии];
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветаСерийДиаграмм() Экспорт
	
	МассивЦветов = Новый Массив;
	
	МассивЦветов.Добавить(Новый Цвет(245, 152, 150));
	МассивЦветов.Добавить(Новый Цвет(142, 201, 249));
	МассивЦветов.Добавить(Новый Цвет(255, 202, 125));
	МассивЦветов.Добавить(Новый Цвет(178, 154, 218));
	МассивЦветов.Добавить(Новый Цвет(163, 214, 166));
	МассивЦветов.Добавить(Новый Цвет(244, 140, 175));
	МассивЦветов.Добавить(Новый Цвет(125, 221, 233));
	МассивЦветов.Добавить(Новый Цвет(255, 242, 128));
	МассивЦветов.Добавить(Новый Цвет(205, 145, 215));
	МассивЦветов.Добавить(Новый Цвет(125, 202, 194));
	
	Возврат МассивЦветов;
	
КонецФункции

#КонецОбласти
